src/Documents/Акция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Акция</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыАкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СериализованноеРасписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПодарков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеАкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветЦелевыхТоваров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПремиальныеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Станция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Станции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦелевыеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Акция/Ext/ManagerModule.bsl
// Возвращает действующие на момент времени акции
//
// Параметры:
//	Дата  - Дата - 	дата и время, на которое требуется получить акции.
//					Если параметр не указан, берется текущая дата
//
// Возвращаемое значение:
//	Массив   - массив ссылок на документы "Акция"
//
Функция ДействующиеАкции(Дата = Неопределено) Экспорт
	
	Дата = ?(Дата = Неопределено, ТекущаяДата(), Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Акция.Ссылка Акция
	|ИЗ
	|	Документ.Акция КАК Акция
	|ГДЕ
	|	Акция.ДатаС <= &Дата
	|	И (Акция.ДатаПо >= &Дата
	|			ИЛИ Акция.ДатаПо = ДАТАВРЕМЯ(1, 1, 1))
	|	И Акция.Проведен";
	Запрос.УстановитьПараметр("Дата",Дата);
	ТЗ = Запрос.Выполнить().Выгрузить();
	М = Новый Массив;
	Для каждого Т Из ТЗ Цикл
		Расписание = ЗначениеИзСтрокиВнутр(Т.Акция.СериализованноеРасписание);
		Если Не Расписание.ТребуетсяВыполнение(Дата) Тогда
			
			М.Добавить(Т);		
			
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Т Из М Цикл
		ТЗ.Удалить(Т);
	КонецЦикла; 
	Возврат ТЗ.ВыгрузитьКолонку("Акция");
КонецФункции

//0ли Клиент тогда
Процедура ОбновитьЦветаАкций(ЦветаАкционныхТоваров) Экспорт
	ДействующиеАкции = Документы.Акция.ДействующиеАкции();
	Для Каждого Акция Из ДействующиеАкции Цикл
		Если Акция.ТипАкции = Справочники.ТипыАкций.НаборТоваров Тогда
			Для каждого Т Из Акция.ЦелевыеТовары Цикл
				
				ЦветаАкционныхТоваров.Вставить(Т.Товар, Акция.ЦветЦелевыхТоваров.Получить());
				
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
//00!!)0!))ggggf0&$!?ли
